integration_testing/pepys/media_service/SetVideoEncoderConfiguration.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<wsse:UsernameToken>
				<wsse:Username>admin</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">no00l3tLswdQ1W3n0mFqCxXE75M=</wsse:Password>
				<wsse:Nonce>VqKnEzdtNGVWLKc9Jas3+A==</wsse:Nonce>
				<wsu:Created>2022-03-07T13:19:53Z</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</s:Header>
	<s:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
		<SetVideoEncoderConfiguration xmlns="http://www.onvif.org/ver10/media/wsdl">
			<Configuration token="encoder_config_token">
				<Name xmlns="http://www.onvif.org/ver10/schema">PiCameraConfiguration</Name>
				<UseCount xmlns="http://www.onvif.org/ver10/schema">0</UseCount>
				<Encoding xmlns="http://www.onvif.org/ver10/schema">H264</Encoding>
				<Resolution xmlns="http://www.onvif.org/ver10/schema">
					<Width>640</Width>
					<Height>480</Height>
				</Resolution>
				<Quality xmlns="http://www.onvif.org/ver10/schema">0</Quality>
				<RateControl xmlns="http://www.onvif.org/ver10/schema">
					<FrameRateLimit>10</FrameRateLimit>
					<EncodingInterval>1</EncodingInterval>
					<BitrateLimit>10000</BitrateLimit>
				</RateControl>
				<H264 xmlns="http://www.onvif.org/ver10/schema">
					<GovLength>60</GovLength>
					<H264Profile>High</H264Profile>
				</H264>
				<Multicast xmlns="http://www.onvif.org/ver10/schema">
					<Address>
						<Type>IPv4</Type>
						<IPv4Address>0.0.0.0</IPv4Address>
					</Address>
					<Port>0</Port>
					<TTL>1</TTL>
					<AutoStart>false</AutoStart>
				</Multicast>
				<SessionTimeout xmlns="http://www.onvif.org/ver10/schema">PT1000S</SessionTimeout>
			</Configuration>
			<ForcePersistence>true</ForcePersistence>
		</SetVideoEncoderConfiguration>
	</s:Body>
</s:Envelope>